---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNamingIndex
source: html/d08348cf-7565-0149-15ec-303473df6d79.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNamingIndex Property

"Circuit Naming Index"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecCircuitNamingIndex { get; }
```